Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_rmu.h
/**
  *******************************************************************************************************
  * @file    fm33ld5xx_fl_rmu.h
  * @author  FMSH Application Team
  * @brief   Head file of RMU FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LD5XX_FL_RMU_H
#define __FM33LD5XX_FL_RMU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33ld5xx_fl_def.h"
/** @addtogroup FM33LD5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup RMU_FL_ES_INIT RMU Exported Init structures
  * @{
  */








/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup RMU_FL_Exported_Constants RMU Exported Constants
  * @{
  */

#define    RMU_PDRCR_CFG_Pos                                      (1U)
#define    RMU_PDRCR_CFG_Msk                                      (0x3U << RMU_PDRCR_CFG_Pos)
#define    RMU_PDRCR_CFG                                          RMU_PDRCR_CFG_Msk

#define    RMU_PDRCR_EN_Pos                                       (0U)
#define    RMU_PDRCR_EN_Msk                                       (0x1U << RMU_PDRCR_EN_Pos)
#define    RMU_PDRCR_EN                                           RMU_PDRCR_EN_Msk

#define    RMU_RSTCR_LOLRST_EN_Pos                                (7U)
#define    RMU_RSTCR_LOLRST_EN_Msk                                (0x1U << RMU_RSTCR_LOLRST_EN_Pos)
#define    RMU_RSTCR_LOLRST_EN                                    RMU_RSTCR_LOLRST_EN_Msk

#define    RMU_RSTCR_LOCRST_EN_Pos                                (6U)
#define    RMU_RSTCR_LOCRST_EN_Msk                                (0x1U << RMU_RSTCR_LOCRST_EN_Pos)
#define    RMU_RSTCR_LOCRST_EN                                    RMU_RSTCR_LOCRST_EN_Msk

#define    RMU_RSTCR_LKUPRST_EN_Pos                               (1U)
#define    RMU_RSTCR_LKUPRST_EN_Msk                               (0x1U << RMU_RSTCR_LKUPRST_EN_Pos)
#define    RMU_RSTCR_LKUPRST_EN                                   RMU_RSTCR_LKUPRST_EN_Msk

#define    RMU_RSTFR_CLM2_TOUT_FLAG_Pos                           (24U)
#define    RMU_RSTFR_CLM2_TOUT_FLAG_Msk                           (0x1U << RMU_RSTFR_CLM2_TOUT_FLAG_Pos)
#define    RMU_RSTFR_CLM2_TOUT_FLAG                               RMU_RSTFR_CLM2_TOUT_FLAG_Msk

#define    RMU_RSTFR_CLM2_UDF_FLAG_Pos                            (23U)
#define    RMU_RSTFR_CLM2_UDF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM2_UDF_FLAG_Pos)
#define    RMU_RSTFR_CLM2_UDF_FLAG                                RMU_RSTFR_CLM2_UDF_FLAG_Msk

#define    RMU_RSTFR_CLM2_OVF_FLAG_Pos                            (22U)
#define    RMU_RSTFR_CLM2_OVF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM2_OVF_FLAG_Pos)
#define    RMU_RSTFR_CLM2_OVF_FLAG                                RMU_RSTFR_CLM2_OVF_FLAG_Msk

#define    RMU_RSTFR_CLM1_TOUT_FLAG_Pos                           (21U)
#define    RMU_RSTFR_CLM1_TOUT_FLAG_Msk                           (0x1U << RMU_RSTFR_CLM1_TOUT_FLAG_Pos)
#define    RMU_RSTFR_CLM1_TOUT_FLAG                               RMU_RSTFR_CLM1_TOUT_FLAG_Msk

#define    RMU_RSTFR_CLM1_UDF_FLAG_Pos                            (20U)
#define    RMU_RSTFR_CLM1_UDF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM1_UDF_FLAG_Pos)
#define    RMU_RSTFR_CLM1_UDF_FLAG                                RMU_RSTFR_CLM1_UDF_FLAG_Msk

#define    RMU_RSTFR_CLM1_OVF_FLAG_Pos                            (19U)
#define    RMU_RSTFR_CLM1_OVF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM1_OVF_FLAG_Pos)
#define    RMU_RSTFR_CLM1_OVF_FLAG                                RMU_RSTFR_CLM1_OVF_FLAG_Msk

#define    RMU_RSTFR_CLM0_TOUT_FLAG_Pos                           (18U)
#define    RMU_RSTFR_CLM0_TOUT_FLAG_Msk                           (0x1U << RMU_RSTFR_CLM0_TOUT_FLAG_Pos)
#define    RMU_RSTFR_CLM0_TOUT_FLAG                               RMU_RSTFR_CLM0_TOUT_FLAG_Msk

#define    RMU_RSTFR_CLM0_UDF_FLAG_Pos                            (17U)
#define    RMU_RSTFR_CLM0_UDF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM0_UDF_FLAG_Pos)
#define    RMU_RSTFR_CLM0_UDF_FLAG                                RMU_RSTFR_CLM0_UDF_FLAG_Msk

#define    RMU_RSTFR_CLM0_OVF_FLAG_Pos                            (16U)
#define    RMU_RSTFR_CLM0_OVF_FLAG_Msk                            (0x1U << RMU_RSTFR_CLM0_OVF_FLAG_Pos)
#define    RMU_RSTFR_CLM0_OVF_FLAG                                RMU_RSTFR_CLM0_OVF_FLAG_Msk

#define    RMU_RSTFR_TEST_FLAG_Pos                                (15U)
#define    RMU_RSTFR_TEST_FLAG_Msk                                (0x1U << RMU_RSTFR_TEST_FLAG_Pos)
#define    RMU_RSTFR_TEST_FLAG                                    RMU_RSTFR_TEST_FLAG_Msk

#define    RMU_RSTFR_RAMP_FLAG_Pos                                (14U)
#define    RMU_RSTFR_RAMP_FLAG_Msk                                (0x1U << RMU_RSTFR_RAMP_FLAG_Pos)
#define    RMU_RSTFR_RAMP_FLAG                                    RMU_RSTFR_RAMP_FLAG_Msk

#define    RMU_RSTFR_MAP_FLAG_Pos                                 (13U)
#define    RMU_RSTFR_MAP_FLAG_Msk                                 (0x1U << RMU_RSTFR_MAP_FLAG_Pos)
#define    RMU_RSTFR_MAP_FLAG                                     RMU_RSTFR_MAP_FLAG_Msk

